/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "collection-banner": {
      "type": "main-collection-banner",
      "custom_css": [
        ".mt-4 {margin-top: calc(4 * var(--space-unit)); width: 100%; /* display: block; */ /* text-align: left; */}"
      ],
      "settings": {
        "show_collection_title": true,
        "show_product_count": false,
        "show_collection_description": true,
        "text_align": "items-center text-center",
        "collection_image": "none",
        "use_product_image": false,
        "text_width": "wide",
        "color_scheme": "default"
      }
    },
    "collection-products": {
      "type": "main-collection-products",
      "custom_css": [
        ".price__from {color: red; font-size: 22px;}",
        ".card--product-contained {--text-color: var(--card-text-color); padding: calc(5 * var(--space-unit)); border: 1px solid #000; background-color: var(--card-bg-color); color: rgb(var(--card-text-color));}"
      ],
      "settings": {
        "products_per_page": 50,
        "card_size_mobile": "large",
        "card_size": "large",
        "show_layout_toggle": true,
        "enable_filtering": true,
        "filters_open_lg": true,
        "stick_on_scroll": true,
        "show_filter_counts": true,
        "expand_filters": true,
        "max_filter_options": 30,
        "enable_sorting": true,
        "sort_show_featured": true,
        "sort_show_best": true,
        "sort_show_alpha": true,
        "sort_show_price": true,
        "sort_show_date": true,
        "sort_first": true
      }
    },
    "1760013246b95898ae": {
      "type": "apps",
      "blocks": {
        "avada_seo_suite_avada_after_collection_block_kLaF3K": {
          "type": "shopify://apps/avada-seo-suite/blocks/avada-after-collection-block/15507c6e-1aa3-45d3-b698-7e175e033440",
          "disabled": true,
          "settings": {}
        }
      },
      "block_order": [
        "avada_seo_suite_avada_after_collection_block_kLaF3K"
      ],
      "settings": {
        "full_width": false
      }
    },
    "faq_FwCrcQ": {
      "type": "faq",
      "blocks": {
        "question_gEEbpM": {
          "type": "question",
          "settings": {
            "icon": "award",
            "heading": "Heavenly Beds Luxury Bed Frames",
            "text": "<p>In this guide, we’ll walk you through <strong>single bed sizes</strong>, storage options, mattress considerations, and how to pick the ideal style. Let’s get started.</p><h3>What Size Is a Single Bed?</h3><p>One of the most common questions is <strong>“what size is a single bed?”</strong> In the UK, a standard <strong>single bed size</strong> is 3 ft (approx. 90 cm) wide and about 190 cm long (6′3″). That gives you comfortable space for one adult or child while conserving room space.</p><p>If you wonder <strong>how wide is a single bed</strong>, it’s roughly 90 cm. <strong>How long is a single bed?</strong> Around 190 cm.</p><p>Sometimes you’ll also see <strong>small single bed</strong> dimensions (typically about 75 cm × 190 cm) — these are useful in very tight rooms, but you sacrifice some comfort width. In contrast, the standard single (3 ft) strikes a balance between personal space and compactness.</p><h3>Types of Single Beds & Storage Options</h3><p>A big differentiator among single beds is how they handle storage and structure. Here are the most common types and when they’re useful:</p><h4>Single bed frame</h4><p>A <strong>single bed frame</strong> is simply the base (wood, metal, or upholstered) that supports your mattress. You can choose whichever mattress you like. Frames are typically slimmer and more flexible in style, but they may not include under-bed storage.</p><h4>Single bed with storage</h4><p>If you’re short on cupboard space, go for a <strong>single bed with storage</strong>. These usually include drawers built into the base, offering accessible storage without needing to lift the mattress. It’s especially helpful in smaller bedrooms where every square inch matters.</p><h4>Single ottoman bed</h4><p>A <strong>single ottoman bed</strong> provides storage by lifting the entire base (and mattress) upward, giving you full access to the underside. This is great for storing bulky items (bedding, seasonal gear) — just make sure you have enough vertical clearance to lift the mechanism.</p><h4>Single bed with mattress</h4><p>If you’d rather get everything in one purchase, look for a <strong>single bed with mattress</strong>. These bundles save you the effort of choosing a mattress separately, and they ensure compatibility of base, slats, and support.</p><h4>Kids and compact options</h4><p>For a <a href=\"https://www.heavenlybeds.co.uk/collections/children-beds\" target=\"_blank\"><strong>kids single bed</strong>,</a> standard size often works well (3 ft), but for very small rooms or toddlers you might consider a <strong>small single bed</strong> variant. Always check height and edge safety.</p><h3>What to Consider When Choosing a Single Bed</h3><p>When you browse our collection, here are key features and trade-offs to keep in mind. The right choice depends on your priorities (storage, aesthetics, budget, ease of setup).</p><h4>Storage vs ease of access</h4><ul><li><strong>Drawer storage (divan style)</strong> is great if you access belongings often — pull them out without disturbing bedding.<br/></li><li><strong>Ottoman storage</strong> gives more capacity but requires lifting the mattress and base — best for things you don’t need daily.<br/></li></ul><h4>Headboard design & height</h4><p>A tall, plush headboard makes the bed a focal point. A minimal or low headboard keeps things visually light in small rooms. Consider whether you want a headboard that leans forward (for reading) or a flat one.</p><h4>Materials & upholstery</h4><p>Upholstered beds (fabric, velvet, faux leather) soften the room and add texture. Metal or wood frames feel more minimalistic or classic. Think about wear, ease of cleaning, stains, and style matching.</p><h4>Weight support & frame build</h4><p>Check what weight the frame supports (including mattress + sleeper). More robust builds (reinforced slats, thicker frames) last longer and resist sagging.</p><h4>Mattress compatibility & depth</h4><p>Ensure that the <strong>single bed mattress</strong> depth works with the frame and headboard. Deep mattresses (e.g. 25-30 cm) may require higher side rails or deeper bases. Also, make sure the mattress fits the standard 90 × 190 cm dimensions.</p><h4>Room layout & clearance</h4><p>Leave at least 60–70 cm clearance on one side (or both sides) so you can move around the bed, open drawers, or make the bed easily. Be cautious with ottoman lift clearance — you’ll need space for the lid to swing open.</p><h3>Why Choose Our 3 ft Single Beds</h3><ul><li><strong>Variety & flexibility</strong> - You’ll find options in every style: modern, classic, upholstered, minimalist.<br/></li><li><strong>Smart storage integration</strong> - Many models come with drawers or ottoman lifts seamlessly built in.<br/></li><li><strong>Bundle options</strong> - Some beds are offered <strong>with mattress</strong> so you don’t need to make separate choices.<br/></li><li><strong>Child-safe designs</strong> - Heights and railings suit children and teens without compromising aesthetics.<br/></li><li><strong>Quality & warranty</strong> - Our beds are built for stability, comfort, and durability, backed by honest guarantees (similar to the standards seen in established bed retailers).<br/></li><li><strong>Fast and reliable delivery & setup</strong> - We provide full support from ordering to assembly (or instructions) to ensure your sleep solution arrives stress-free.<br/></li></ul><h3>Frequently Asked Questions</h3><p>Here are answers to common questions people search while shopping for a <strong>single bed</strong>:</p><p><strong>1. What is the difference between a single bed frame and a bed with storage?</strong></p><p>A <strong>frame</strong> is simply the structure supporting the mattress, whereas a <strong>single bed with storage</strong> includes built-in drawers or compartments in the base, giving you extra room to store blankets, clothes, or seasonal items.</p><p><strong>2. How big is a single ottoman bed?</strong></p><p>It uses the same footprint as a standard single (3 ft × 6′3″), but the base is hinged so the mattress lifts up to reveal a storage cavity underneath. Just make sure you have enough clearance above the bed to lift it fully.</p><p><strong>3. Does a single bed with mattress package provide a good mattress?</strong></p><p>Usually yes — these sets are designed so the mattress and base are compatible. Always check mattress type (memory foam, pocket spring, etc.), firmness, and depth to ensure they suit your needs.</p><p><strong>4. What is a small single bed and when is it useful?</strong></p><p>A <strong>small single bed</strong> is narrower than a standard single (often ~75 cm wide) — useful in very tight rooms like narrow halls, dens, or for very small children. But it offers less sleeping freedom, especially for adults.</p><p><strong>5. How big is a standard single bed?</strong></p><p>3 ft (90 cm) wide × 190 cm (approx. 6′3″) long. That’s the standard in many UK collections.</p><p><strong>6. How wide is a single bed?</strong></p><p>90 cm (3 ft). Some “small single” options are narrower (75 cm) but may feel tighter for some sleepers.</p><p><strong>7. How long is a single bed?</strong></p><p>Typically around 190 cm (6 feet 3 inches). Some mattress manufacturers slightly vary (188, 191 cm) but that’s the usual standard.</p><p><strong>8. Can an adult sleep comfortably in a single bed?</strong></p><p>Yes — a standard single provides adequate space for most adults. But if you move around a lot or prefer more width, a wider bed might feel more comfortable.</p><p><strong>9. What is the best storage option: drawers or ottoman?</strong></p><p>It depends. <strong>Drawers</strong> are easier to access without disturbing your bedding, great when you use the storage frequently. <strong>Ottoman</strong> provides deeper, unobstructed space but requires lifting and more clearance above.</p><p><strong>10. Will a mattress stay in place on a bed with storage?</strong></p><p>Yes, when the base is properly designed (with side rails, stopper bars, or friction strips) the mattress should remain stable. High-quality beds ensure the mattress stays put even with movement.</p><h3>Styling & Room Ideas</h3><ul><li><strong>Minimal & modern</strong>: Combine a low-profile <strong>single bed frame</strong> in metal or neutral upholstery with a slim bedside table and floating shelves to keep floor space open.<br/></li><li><strong>Compact comfort</strong>: Use a <strong>single bed with storage</strong> or <strong>ottoman bed</strong> to eliminate the need for a separate shoe or linen cabinet in small rooms.<br/></li><li><strong>Colour layering</strong>: Choose a neutral bed base and accent with coloured throws, pillows, or a bold headboard.<br/></li><li><strong>Kids’ rooms</strong>: Opt for lower frames, rounded corners, or rails for safety. Use bright bedding or themed cushions to let the bed reflect their personality.<br/></li><li><strong>Guest room simplicity</strong>: A well-made <strong>single bed with mattress</strong> set ensures visitors don’t need to compromise — and clears your mind of choosing separate elements.<br/></li></ul><h3>Final Tips Before You Buy</h3><ol><li>Measure your room carefully - door width, ceiling height, space for slide-out drawers or lifting ottoman.<br/></li><li>Consider what you’ll store - bulky winter clothes or light linens? This helps choose drawer size vs depth.<br/></li><li>Match mattress depth with base height to ensure the bed edge isn’t too high or too low.<br/></li><li>If possible, go for a bed + mattress combination (especially in promos) - it often guarantees ideal compatibility.<br/></li><li>Think ahead - you may move rooms later, so a neutral frame or easy-to-match style gives flexibility.<br/></li><li>Don’t forget delivery & assembly - make sure the pathway in your home (stairs, tight corners) allows the bed parts to come through.<br/></li></ol>"
          }
        }
      },
      "block_order": [
        "question_gEEbpM"
      ],
      "name": "Collapsible content",
      "settings": {
        "heading": "",
        "heading_align": "text-center",
        "color_scheme": "1",
        "full_width": true
      }
    }
  },
  "order": [
    "collection-banner",
    "collection-products",
    "1760013246b95898ae",
    "faq_FwCrcQ"
  ]
}
